app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'ca@sada.it' LIMIT 1
---
  def create
    # get the user email from the sign in form
    user = User.find_by_email(params[:session][:email].downcase)