app/controllers/users_controller.rb

  def show
    # get the user with id :id
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

  def create         #crea un nuovo utente anche nel db
    # refine the user variable content with the data passed by the sign up form
    @user = User.new(params[:user])    #crea un nuovo utente utilizzando tutti i dati passati nel form e memorizzando il tutto nella variabile @user
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?)